Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationRodsConnectionChangedWarning Property
 The structural component that the hanger is attached to has changed to a different element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationRodsConnectionChangedWarning { get; }
Public Shared ReadOnly Property FabricationRodsConnectionChangedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationRodsConnectionChangedWarning {
	FailureDefinitionId^ get ();
}
static member FabricationRodsConnectionChangedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace